In [10]:
#Q1

import pandas as pd

l1 = ['Japan','Germany','Italy','Russia', 'Poland', 'Ireland']

ser = pd.Series(l1)

print(ser)

0      Japan
1    Germany
2      Italy
3     Russia
4     Poland
5    Ireland
dtype: object

In [21]:
#Q2

pd.date_range(start='05-01-2021', end='05-12-2021')

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [26]:
#Q3
#Q2
d={'Country':['India','Russia','Sri Lanka','Australia','Argentina', 'Japan'],
   'Capital':['New Delhi','Moscow','Colombo','Canberra','Buenos Aires','Tokyo']
}

pd.DataFrame.from_dict(d)

     Country       Capital
0      India     New Delhi
1     Russia        Moscow
2  Sri Lanka       Colombo
3  Australia      Canberra
4  Argentina  Buenos Aires
5      Japan         Tokyo

In [29]:
#Q4

l2 = [
    [12,33,42],
    [35,45,55],
    [63,73,83]
]

pd.DataFrame(l2)

    0   1   2
0  12  33  42
1  35  45  55
2  63  73  83

In [70]:
#Q5

df=pd.read_csv("an_th.csv")
df

       cars manufacturers
0  alto 800        suzuki
1    innova        toyota
2       i20       hyundai
3   xuv 700      mahindra
4    seltos           kia

In [45]:
#Q6

df.sort_values(by=['cars','manufacturers'], ascending=True)

       cars manufacturers
0  alto 800        suzuki
2       i20       hyundai
1    innova        toyota
4    seltos           kia
3   xuv 700      mahindra

In [51]:
#Q7

d = {
    "name" :["Manu", "Jewel", "Aswin"],
    "marks":[100, 120, 90]
}

ind = ['a','b', 'c']
df = pd.DataFrame(d,ind)
print(df)
df.reset_index(inplace=True, drop=True)
df

    name  marks
a   Manu    100
b  Jewel    120
c  Aswin     90

    name  marks
0   Manu    100
1  Jewel    120
2  Aswin     90

In [72]:
#Q8

df.iloc[:2]

       cars manufacturers
0  alto 800        suzuki
1    innova        toyota

In [62]:
#Q9

office = {
    "occupation":['teacher','student','clerk', 'teacher'],
    "salary" : [15000, 0, 45000,10000]
    # "name":["u", "bu", "abu",'abdu']
}
df = pd.DataFrame(office)
df.groupby("occupation")["salary"].mean()"name":["u", "bu", "abu",'abdu']"e_id":[1,2,3],

occupation
clerk      45000.0
student        0.0
teacher    12500.0
Name: salary, dtype: float64

In [65]:
#Q10

import numpy as np
new_df=df
df['salary']=np.NaN
df.fillna(0)

  occupation  salary
0    teacher     0.0
1    student     0.0
2      clerk     0.0
3    teacher     0.0

In [67]:
#Q11

d={
    "company":["IBM","Google","Microsoft"],
    "profit":[-10000,110000,120000]
}"e_id":[1,2,3],
df=pd.DataFrame(d)
df["profit"]=df["profit"]>0
df

     company  profit
0        IBM   False
1     Google    True
2  Microsoft    True

In [68]:
#Q12

d1={
    "e_id":[1,2,3],
    "e_name":["manu","jewel","aswin"],
    "stipend":[100,200,300]
}
d2={
    "e_id":[1,2,3],
    "designation":["teacher","clerk","student"]
}

df1=pd.DataFrame(d1)
df2=pd.DataFrame(d2)

pd.merge(df1,df2,how="inner")

   e_id e_name  stipend designation
0     1   manu      100     teacher
1     2  jewel      200       clerk
2     3  aswin      300     student